package com.fengshen.server.game;

import java.util.HashMap;
import java.util.List;
import java.util.Random;
import java.util.UUID;

import com.fengshen.db.domain.FightObjectInfo;
import org.apache.commons.lang3.StringUtils;

import com.fengshen.db.domain.AccessibilityMap;
import com.fengshen.db.domain.ZhuangbeiInfo;
import com.fengshen.server.data.game.SuitEffectUtils;
import com.fengshen.server.data.vo.Vo_APPEAR;
import com.fengshen.server.util.GameConfig;

import io.netty.util.internal.ThreadLocalRandom;
import lombok.extern.slf4j.Slf4j;

/**
 * 游戏天罡36星和地煞72星的工具类
 * 
 * 
 *
 */
@Slf4j
public class GameBossTianDiXing {

	// 存放星星的集合
	public static java.util.Map<Integer, Vo_APPEAR> xing = new HashMap<>();
	
	
	private static String[] dx = { "地魁星:乾元山、终南山、凤凰山、骷髅山、五龙山:60", "地煞星:乾元山、终南山、凤凰山、骷髅山、五龙山:63", "地勇星:乾元山、终南山、凤凰山、骷髅山、五龙山:66", "地杰星:乾元山、终南山、凤凰山、骷髅山、五龙山:69", 
			 "地雄星:乾元山、终南山、凤凰山、骷髅山、五龙山:72", "地威星:风月谷、十里坡:75", "地英星:五龙窟一层、五龙窟二层:78", "地奇星:五龙窟二层、五龙窟三层:81", "地猛星:五龙窟三层、五龙窟四层:84", "地文星:五龙窟四层、五龙窟五层:87", 
			 "地正星:蓬莱岛、幽冥涧:90", "地辟星:幽冥涧、百花谷一:93", "地阖星:百花谷一、百花谷二:96",
			"地强星:百花谷二、百花谷三:99", "地暗星:百花谷三、百花谷四:102", "地辅星:百花谷四、百花谷五:105", 
			"地会星:百花谷五、百花谷六:108", "地佐星:百花谷六、百花谷七:111", "地佑星:百花谷七、绝人阵:114", "地灵星:绝人阵、绝仙阵:117", 
			"地兽星:绝仙阵、海底迷宫、昆仑云海:120", "地微星:海底迷宫、昆仑云海、雪域冰原:122", "地慧星:昆仑云海、雪域冰原、迷境花树:124", "地暴星:雪域冰原、迷境花树、水云间:126", "地默星:雪域冰原、迷境花树、水云间、热砂荒漠:128", 
			"地猖星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:130", "地狂星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:132", "地飞星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:134"
			,"地巧星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:140","地明星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:143","地进星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:146","地退星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:149"
			,"地满星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:150","地遂星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:153","地周星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:156","地隐星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:159"
			,"地异星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:160","地理星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:163","地俊星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:166","地乐星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:169"
			,"地捷星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:170","地速星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:173","地镇星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:176","地稽星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:179"

	};
	private static String[] tx = {"天魁星:揽仙镇外、卧龙坡:30","天魔星:官道南、官道北、桃柳林:30","天机星:轩辕庙:40","天闲星:轩辕坟一层、轩辕坟二层、轩辕坟三层:45","天勇星:北海沙滩:50","天雄星:五龙山:55",
			"天猛星:十里坡:60","天威星:乾元山:63","天英星:终南山:66","天贵星:凤凰山:69","天富星:骷髅山:72","天满星:风月谷:75",
			"天孤星:五龙窟一层、五龙窟二层:78","天伤星:五龙窟二层、五龙窟三层:81","天立星:五龙窟三层、五龙窟四层:84","天捷星:五龙窟四层、五龙窟五层:87","天暗星:蓬莱岛、幽冥涧:90","天祐星:幽冥涧、百花谷一:93",
			"天空星:百花谷一、百花谷二:96","天速星:百花谷二、百花谷三:99","天异星:百花谷三、百花谷四:102","天杀星:百花谷四、百花谷五:105","天微星:百花谷五、百花谷六:108","天究星:百花谷六、百花谷七:111",
			"天退星:百花谷七、绝人阵:114","天寿星:绝人阵、绝仙阵:117","天剑星:绝仙阵、海底迷宫、昆仑云海:120","天平星:海底迷宫、昆仑云海、雪域冰原:122","天罪星:昆仑云海、雪域冰原、迷境花树:124","天损星:雪域冰原、迷境花树、水云间:126",
			"天败星:雪域冰原、迷境花树、水云间、热砂荒漠:128","天牢星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:130","天慧星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:132","天暴星:雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛:134"
			,"天狗星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:140","天狼星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:143","天澜星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:146","天辰星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:149"
			,"天苍星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:150","天穹星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:153","天圣星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:156","天皇星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:159"
			,"天帝星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:160","天启星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:163","天始星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:166","天御星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:169"
			,"天宙星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:170","天弑星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:173","天陨星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:176","天道星:方丈岛、热砂荒漠、水云间、迷境花树、雪域冰原:179"
	};



	private static String[] bianyiD =  {"鬼差绝阴:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差泰煞:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差犯武:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差罪气:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差宗灵:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差宛屡:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差噬灵:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差煞宗:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差日游巡:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼差夜游巡:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛"

	};
	private static String[] bianyiT = {"角木蛟:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"亢金龙:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"氐土貉:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"房日兔:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"心月狐:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"尾火虎:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"箕水豹:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"井木犴:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"鬼金羊:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"柳土獐:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"星日马:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"张月鹿:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"翼火蛇:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"轸水蚓:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"奎木狼:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"娄金狗:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"胃土雉:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"昴日鸡:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"毕月乌:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"觜火猴:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"参水猿:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"斗木獬:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"牛金牛:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"女土蝠:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"虚日鼠:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"危月燕:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"室火猪:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛",
			"壁水獝:乾元山、终南山、凤凰山、骷髅山、五龙山、五龙窟一层、五龙窟二层、五龙窟三层、五龙窟四层、五龙窟五层、蓬莱岛、幽冥涧、百花谷一、百花谷二、百花谷三、百花谷四、百花谷五、百花谷六、百花谷七、绝人阵、绝仙阵、海底迷宫、昆仑云海、雪域冰原、迷境花树、水云间、热砂荒漠、方丈岛"
	};





	// 随机选择天星或者地星
	public static String getName() {
		 Random seriesRandom = new Random();
		 
		if (seriesRandom.nextBoolean()) {
			return dx[seriesRandom.nextInt(dx.length)];
		}
		return tx[seriesRandom.nextInt(tx.length)];
	}

	public static void shuaxing(Vo_APPEAR v) {
		Random random = ThreadLocalRandom.current();
		String name = getName();
		String[] split = name.split("\\:");
		String bossName = split[0];
		// 随机等级
		int level = Integer.valueOf(split[2]);
		int polar = random.nextInt(5) + 1;
		int sex = random.nextInt(2) + 1;
		Vo_APPEAR vo_65529_0 = new Vo_APPEAR();
		vo_65529_0.id = GameCommonUtil.generateBossId();
		vo_65529_0.uuid = UUID.randomUUID().toString().replace("-", "");
		vo_65529_0.name = bossName;
		vo_65529_0.level = level;
		vo_65529_0.leixing = polar;
		// 获取道刷新地图的集合
		String[] mapNameArr = split[1].split("、");
		// 随机获取一个星星刷新的地图
		String flushMapName = mapNameArr[(int) (Math.random() * mapNameArr.length)];
		if (v != null) {
			// 如果这个不是空的话就在这个地图刷星
			flushMapName = v.mapName;
		}
		vo_65529_0.mapName = flushMapName;
		GameMap map = GameLine.getGameMap(1, flushMapName);
		if (map == null) {
			log.error("地图为空:{}", flushMapName);
			return;
		}
		// 随机获取一个坐标位置
		List<AccessibilityMap> result = GameData.that.accessibilityMapService.findByMapName(flushMapName);
		if (result == null || result.isEmpty()) {
			return;
		}
		int index = ThreadLocalRandom.current().nextInt(result.size());
		AccessibilityMap am = result.get(index);
		vo_65529_0.mapid = map.id;
		vo_65529_0.x = am.getX();
		vo_65529_0.y = am.getY();
		List<ZhuangbeiInfo> infoList = GameData.that.baseZhuangbeiInfoService.findByAttrib(level / 10 * 10);
		for (ZhuangbeiInfo zhuangbeiInfo : infoList) {
			if (zhuangbeiInfo.getAmount() == 1 && zhuangbeiInfo.getMetal() == vo_65529_0.leixing) {
				vo_65529_0.weapon_icon = zhuangbeiInfo.getType();
			}
		}
		vo_65529_0.dir = 7;
		vo_65529_0.icon = GameUtil.getWaiguan(polar, sex, null);
		if (level >= 70) {
			int[] suit = SuitEffectUtils.suit(sex - 1, level, polar, random.nextInt(5) + 1);
			// 871305, 7003
			vo_65529_0.suit_icon = suit[0];
			vo_65529_0.suit_light_effect = suit[1];
		}
		vo_65529_0.org_icon = vo_65529_0.icon;
		vo_65529_0.portrait = vo_65529_0.icon;
		// 启动刷星
		GameUtil.sendYaoYan(StringUtils.join("听闻在#R" , GameConfig.lineName , "1线#n，" , "#Y" , vo_65529_0.name , "#n#R(" , level
				, "级)#n将在#R三分钟后#n下凡云游到#Z" , vo_65529_0.mapName , "|1线#Z，期间星君将挑选幸运的道友进行指点，各位道友快去该地图等候吧！"));
		log.info("等待刷新-----星id:{},名字:{},等级:{},地图:{},地图id:{},x:{},y{}", vo_65529_0.id, vo_65529_0.name, level, flushMapName,
				vo_65529_0.mapid, vo_65529_0.x, vo_65529_0.y);
		GameData.that.redisUtils.set(StringUtils.join("XINGXING_REFRESH:",vo_65529_0.id,":",vo_65529_0.mapid), StringUtils.join(am.getMapName(),":",am.getX(),",",am.getY()), 60*3);
		vo_65529_0.isHide = 1;
		vo_65529_0.time = System.currentTimeMillis();
		xing.put(vo_65529_0.id, vo_65529_0);
		
	}
	// 随机选择天星变异或者地星变异
	public static String getName(String type,String lv) {
		Random seriesRandom = new Random();
		if("1".equals(type)){
			return bianyiD[seriesRandom.nextInt(bianyiD.length)]+lv;
		}else{
			return bianyiT[seriesRandom.nextInt(bianyiT.length)]+lv;
		}
	}

	public static void shuaxingxiu(Vo_APPEAR v,String type,String lv,String killName) {
		Random random = ThreadLocalRandom.current();
		String name = getName(type,lv);
		name = name+":"+lv;
		String[] split = name.split("\\:");
		String bossName = split[0];
		// 随机等级
		int level = Integer.valueOf(split[2]);
		int polar = random.nextInt(5) + 1;
		int sex = random.nextInt(2) + 1;
		Vo_APPEAR vo_65529_0 = new Vo_APPEAR();
		vo_65529_0.id = GameCommonUtil.generateBossId();
		vo_65529_0.uuid = UUID.randomUUID().toString().replace("-", "");
		vo_65529_0.name = bossName;
		vo_65529_0.level = level;
		vo_65529_0.leixing = polar;
		// 获取道刷新地图的集合
		String[] mapNameArr = split[1].split("、");
		// 随机获取一个星星刷新的地图
		String flushMapName = mapNameArr[(int) (Math.random() * mapNameArr.length)];
		if (v != null) {
			// 如果这个不是空的话就在这个地图刷星
			flushMapName = v.mapName;
		}
		vo_65529_0.mapName = flushMapName;
		GameMap map = GameLine.getGameMap(1, flushMapName);
		if (map == null) {
			log.error("地图为空:{}", flushMapName);
			return;
		}
		// 随机获取一个坐标位置
		List<AccessibilityMap> result = GameData.that.accessibilityMapService.findByMapName(flushMapName);
		if (result == null || result.isEmpty()) {
			return;
		}
		int index = ThreadLocalRandom.current().nextInt(result.size());
		AccessibilityMap am = result.get(index);
		vo_65529_0.mapid = map.id;
		vo_65529_0.x = am.getX();
		vo_65529_0.y = am.getY();
		if("1".equals(type)){
			List<FightObjectInfo> fightObjectInfos = GameData.that.baseFightObjectService.findByName(bossName);
			if(fightObjectInfos.size()>0){
				vo_65529_0.icon = fightObjectInfos.get(0).getIcon();
			}
			GameUtil.sendYaoYan(StringUtils.join("#R",killName,"#n被击败，六界震动！特派遣冥界#Y",vo_65529_0.name,"#n#R(",level,"级)#n在#R三分钟后#n前往#Z",vo_65529_0.mapName,"|1线#Z彰显冥界威名，期间鬼差将挑选幸运的道友进行指点，各位道友快去该地图等候吧！"));

		}else{
			List<ZhuangbeiInfo> infoList = GameData.that.baseZhuangbeiInfoService.findByAttrib(level / 10 * 10);
			for (ZhuangbeiInfo zhuangbeiInfo : infoList) {
				if (zhuangbeiInfo.getAmount() == 1 && zhuangbeiInfo.getMetal() == vo_65529_0.leixing) {
					vo_65529_0.weapon_icon = zhuangbeiInfo.getType();
				}
			}
			vo_65529_0.dir = 7;
			vo_65529_0.icon = GameUtil.getWaiguan(polar, sex, null);
			if (level >= 70) {
				int[] suit = SuitEffectUtils.suit(sex - 1, level, polar, random.nextInt(5) + 1);
				// 871305, 7003
				vo_65529_0.suit_icon = suit[0];
				vo_65529_0.suit_light_effect = suit[1];
			}
			vo_65529_0.org_icon = vo_65529_0.icon;
			vo_65529_0.portrait = vo_65529_0.icon;
			GameUtil.sendYaoYan(StringUtils.join("#R",killName,"#n被击败，仙界震动！特派遣星君#Y",vo_65529_0.name,"#n#R(",level,"级)#n在#R三分钟后#n前往#Z",vo_65529_0.mapName,"|1线#Z彰显仙界威名，期间星君将挑选幸运的道友进行指点，各位道友快去该地图等候吧！"));
		}

		// 启动刷星
//		GameUtil.sendYaoYan(StringUtils.join("听闻在#R" , GameConfig.lineName , "1线#n，" , "#Y" , vo_65529_0.name , "#n#R(" , level
//				, "级)#n将在#R三分钟后#n下凡云游到#Z" , vo_65529_0.mapName , "|1线#Z，期间星君将挑选幸运的道友进行指点，各位道友快去该地图等候吧！"));
		//GameUtil.sendYaoYan("#R"+killName+"#n被击败，仙界震动！特派遣星君#Y"+bossName+"#n#R("+level+"级)#n将在#R三分钟后#n前往#Z"+flushMapName+"彰显仙界威名，期间星君将挑选幸运的道友进行指点，各位道友快去该地图等候吧！");
		//GameUtil.sendYaoYan("#R"+killName+"#n被击败，仙界震动！特派遣星君#R"+bossName+"#n#R("+level+"级)#n将在#R三分钟后#n前往"+flushMapName+");
			log.info("等待刷新变异-----星id:{},名字:{},等级:{},地图:{},地图id:{},x:{},y{}", vo_65529_0.id, vo_65529_0.name, level, flushMapName,
				vo_65529_0.mapid, vo_65529_0.x, vo_65529_0.y);
		GameData.that.redisUtils.set(StringUtils.join("XINGXING_REFRESH:",vo_65529_0.id,":",vo_65529_0.mapid), StringUtils.join(am.getMapName(),":",am.getX(),",",am.getY()), 60*3);
		vo_65529_0.isHide = 1;
		vo_65529_0.time = System.currentTimeMillis();
		vo_65529_0.score=11;
		xing.put(vo_65529_0.id, vo_65529_0);

	}

}
